<?php
/**
 * プロトコル部のキュー名のENUMファイル
 * 
 * ライブラリ用
 */

namespace SocketManager\Library;


/**
 * プロトコル部の規定のキュー名定義
 * 
 * ライブラリ用
 */
enum ProtocolQueueEnum: string
{
    //--------------------------------------------------------------------------
    // 定数
    //--------------------------------------------------------------------------

    /**
     * @var アクセプト時のキュー名
     */
    case ACCEPT = 'accept';

    /**
     * @var コネクション時のキュー名
     */
    case CONNECT = 'connect';

    /**
     * @var 受信時のキュー名
     */
    case RECV = 'recv';

    /**
     * @var 送信時のキュー名
     */
    case SEND = 'send';

    /**
     * @var 切断時のキュー名
     */
    case CLOSE = 'close';

    /**
     * @var アライブチェック時のキュー名
     */
    case ALIVE = 'alive';


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
