<?php
/**
 * コマンド部のキュー名のENUMファイル
 * 
 * TCPマルチサーバー用
 */

namespace App\CommandUnits;


/**
 * コマンド部のキュー名定義
 * 
 * TCPマルチサーバー用
 */
enum CommandQueueEnumForTcpMulti: string
{
    //--------------------------------------------------------------------------
    // 定数
    //--------------------------------------------------------------------------

    /**
     * @var プライベートコメント送信検索のキュー名
     */
    case PRIVATE_SEARCH = 'private-search';

    /**
     * @var プライベートコメント送信結果受信時のキュー名
     */
    case PRIVATE_RESULT = 'private-result';

    /**
     * @var ユーザー検索時のキュー名
     */
    case USERSEARCH = 'usersearch';

    /**
     * @var ユーザー検索結果受信時のキュー名
     */
    case USERSEARCH_RESULT = 'usersearch-result';


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
