<?php
/**
 * コマンドUNITステータス名のENUMファイル
 * 
 * UDPマルチサーバー用
 */

namespace App\CommandUnits;


/**
 * コマンドUNITステータス名定義
 * 
 * UDPマルチサーバー用
 */
enum CommandStatusEnumForUdpMulti: string
{
    //--------------------------------------------------------------------------
    // 定数（共通）
    //--------------------------------------------------------------------------

    /**
     * @var 処理開始時のステータス名
     */
    case START = CommandStatusEnumForTcpMulti::START->value;


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
