<?php
/**
 * コマンドUNITステータス名のENUMファイル
 * 
 * マインクラフト用
 */

namespace App\CommandUnits;


/**
 * コマンドUNITステータス名定義
 * 
 * マインクラフト用
 */
enum CommandStatusEnumForMinecraft: string
{
    //--------------------------------------------------------------------------
    // 定数（共通）
    //--------------------------------------------------------------------------

    /**
     * @var 処理開始時のステータス名
     */
    case START = CommandStatusEnumForWebsocket::START->value;


    //--------------------------------------------------------------------------
    // 定数（CommandQueueEnumForMinecraft::USERSEARCH_RESULTキュー）
    //--------------------------------------------------------------------------

    /**
     * @var ユーザー検索結果送信中のステータス名
     */
    case SENDING = 'sending';


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
