<?php
/**
 * コマンドUNITステータス名のENUMファイル
 * 
 * TCPマルチサーバー用
 */

namespace App\CommandUnits;

use SocketManager\Library\StatusEnum;


/**
 * コマンドUNITステータス名定義
 * 
 * TCPマルチサーバー用
 */
enum CommandStatusEnumForTcpMulti: string
{
    //--------------------------------------------------------------------------
    // 定数（共通）
    //--------------------------------------------------------------------------

    /**
     * @var 処理開始時のステータス名
     */
    case START = StatusEnum::START->value;


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
