<?php
/**
 * プロトコルUNITステータス名のENUMファイル
 * 
 * Websocket用
 */

namespace App\ProtocolUnits;


use SocketManager\Library\StatusEnum;


/**
 * プロトコルUNITステータス名定義
 * 
 * Websocket用
 */
enum ProtocolStatusEnumForWebsocket: string
{
    //--------------------------------------------------------------------------
    // 定数（共通）
    //--------------------------------------------------------------------------

    /**
     * @var string 処理開始時のステータス共通
     */
    case START = StatusEnum::START->value;

    /**
     * @var string 送信中のステータス名
     */
    case SENDING = 'sending';

    /**
     * @var string ペイロード長受信のステータス名
     */
    case LENGTH = 'length';

    /**
     * @var string マスクデータ受信のステータス名
     */
    case MASK = 'mask';

    /**
     * @var string ペイロードデータ受信のステータス名
     */
    case PAYLOAD = 'payload';


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::ACCEPTキュー）
    //--------------------------------------------------------------------------

    /**
     * @var string レスポンスデータ作成のステータス名
     */
    case CREATE = 'create';

    /**
     * @var string レスポンス送信のステータス名
     */
    case SEND = 'send';


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::RECVキュー）
    //--------------------------------------------------------------------------


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::SENDキュー）
    //--------------------------------------------------------------------------


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::CLOSEキュー）
    //--------------------------------------------------------------------------


    //--------------------------------------------------------------------------
    // 定数（ProtocolQueueEnum::ALIVEキュー）
    //--------------------------------------------------------------------------

    /**
     * @var string 受信中のステータス名
     */
    case RECV = 'recv';


    //--------------------------------------------------------------------------
    // メソッド
    //--------------------------------------------------------------------------

}
